Revit 2024 API
BuiltInFailures.DimensionFailures.LinearConstraintNotParallel Property
 The References of the highlighted Dimension are no longer parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LinearConstraintNotParallel { get; }
Visual Basic
Public Shared ReadOnly Property LinearConstraintNotParallel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LinearConstraintNotParallel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace